zhanglang-jqk/store-devece-esp8266/src/main.cpp
#if 1
/***********************************************************************
 * @file 	:	main.cpp
 * @author	:	CH
 * @brief	:
 * @Copyright (C)  2024-01-30  .cdWFVCEL. all right reserved
 ***********************************************************************/

/* include ------------------------------------------------------------------------------------------------- */
// #include "main.h"
#include "include.h"
#include <ESP8266WiFi.h>
#include <PubSubClient.h>
#include <Ticker.h>
#include <DNSServer.h>

#include "digit_out.h"
#include "led.h"
#include "key.hpp"
#include "debug.h"
#include "net_man.hpp"
#include "param.hpp"

#include "debug.h"
#include "cmd_pkt.h"
#include "TTS.h"
#include "tm1620.h"
#include "bonezegei_softserial.h"
/* macro definition ------------------------------------------------------------------------------------------------- */

#define SOFT_VERSION "1.2"

#define LED_RELAY_STAT 12
#define LED_SIGNAL 13
#define ON_LED_RELAY 0
#define OFF_LED_RELAY 1
#define ON_LED_SIGNAL 0
#define OFF_LED_SIGNAL 1

#define RELAY_GPIO 5
#define KEY_GPIO 2

#define CLK_PIN 14
#define DIO_PIN 13
#define STB_PIN 12

#define TTS_PIN_RX 16
#define TTS_PIN_TX 4
/* type definition ------------------------------------------------------------------------------------------------- */

/* variable declaration ------------------------------------------------------------------------------------------------- */
// LED led;
DOut relay;
Key key;
Ticker ticker;
NetClient net_client;
Param param;
CmdPkt cmd_pkt;
// SoftwareSerial softserial(TTS_PIN_RX, TTS_PIN_TX);
Bonezegei_SoftSerial softserial(TTS_PIN_RX, TTS_PIN_TX);

TTS tts;
TM1620 disp;
DNSServer dnsServer;
const byte DNS_PORT = 53;
IPAddress apIP(192, 168, 4, 1);

uint8_t g_tmpbuf[1024];

typedef struct
{
  // uint8_t topic[32];
  // uint8_t payload[32];
  bool send_f;
  // uint8_t u8_arg;
  // uint16_t u16_arg;
  // uint32_t u32_arg;
  // uint64_t u64_arg;
  // uint8_t *u8_ptr_arg;
  // uint16_t *u16_ptr_arg;
  // uint32_t *u32_ptr_arg;
  // uint64_t *u64_ptr_arg;
} PublicData_t;

struct
{
  enum
  {
    RETRY_WIFI_CONN_CNT = 3,   // WIFI 杩炴帴閲嶈瘯娆℃
    RETRY_MQTT_CONN_CNT = 3,   // MQTT 杩炴帴閲嶈瘯娆℃
    RETRY_MQTT_SUBPUB_CNT = 3, // MQTT 璁㈤槄鍙戝竷閲嶈瘯娆℃暟

    LOOP_PERIOD_MS = 50, // 涓诲惊鐜懆?

    INIT_STAT,
    CONN_WIFI_STAT,
    CONN_MQTT_SVR_STAT,
    SYS_RESTART_STAT,
    APP_LOOP_STAT,
    MQTT_SUBSCRIPT_STAT,
    WIFI_INFO_CONFIG_STAT,
  };

  uint8_t retry_wifi_cnt = 0;
  uint8_t retry_mqtt_cnt = 0;
  uint8_t retry_mqtt_subpub_cnt = 0;
  uint8_t stat = INIT_STAT;

  uint32_t last_ms_st = 0; // 涓婃鏃堕棿?

  struct
  {
    uint8_t stat;
    uint8_t LOOP_PERIOD_MS = 10; // 10MS
    uint8_t RETRY_TTS_CNT = 3;   // 閲嶈瘯娆℃暟
    uint32_t period_last_ms_st;
    // uint32_t wait_response_last_ms; // 涓婃鏃堕棿?
    uint8_t playbuf[32];
    uint16_t playbuf_len;
    bool play_cmd_f;
    uint8_t retry_cnt;
  } PLAY_VOICE_CMD_fsm;

  struct
  {
    bool count_down_start_f;
    uint8_t stat;
    uint32_t count_down_inc_sec;
    // uint32_t count_down_inc_minute;
    uint32_t minute_last_ms_st;
    uint32_t sec_last_ms_st;
    uint8_t disp_colon_f;
  } count_down_fsm;

  struct
  {
    uint8_t stat;
    uint16_t LOOP_PERIOD_MS = 1000;
    uint32_t last_ms_st;
  } param_fsm;

  struct
  {
    uint8_t stat;
    uint8_t LOOP_PERIOD_MS = 10; // 10MS
    uint32_t last_ms_st;
    bool ap_en; // 0:鍏抽棴AP, 1:鎵撳紑AP
    bool config_finish_f;
  } web_server_fsm;

  struct
  {
    uint8_t stat;
    uint8_t LOOP_PERIOD_MS = 10; // 10MS
    uint32_t last_ms_st;
    // -------------------------------------------------------------------------------------------------
    uint8_t event_f; // 0:none 1:direct toggle door, 2:auto close door 3: wifi info config
    uint32_t event_last_ms_st;
    uint8_t event_stat;
  } key_fsm;

  struct
  {
    uint8_t stat;
    String ssid, pwd;
    bool cfg_finish_f;
  } wifi_cfg_fsm;

  struct
  {
    // uint8_t stat;
    uint32_t last_ms;
    uint8_t retry_cnt;
    const uint16_t LOOP_PERIOD_MS = 1000;
    const uint8_t MAX_RETRY_CNT = 3;
  } conn_mqtt_svr_fsm;

  struct
  {
    uint8_t stat;
    uint32_t last_ms;
    const uint16_t LOOP_PERIOD_MS = 500;
    bool disp_f;
  } net_seg_indicate_fsm;

  struct
  {
    uint8_t stat;
    const uint16_t MAIN_SCAN_PERIOD_MS = 500;
    uint32_t main_last_ms;
    bool conn_svr_f;
    bool disp_val_f;
  } seg_disp_fsm;

  struct // TODO wait for implement
  {
    PublicData_t count_down_finish_event;
    PublicData_t relay_state_update_event;
    PublicData_t PLAY_VOICE_CMD_cmd_ok_event;
    PublicData_t PLAY_VOICE_CMD_cmd_err_event;
    PublicData_t conn_svr_baseinfo_event; // then connect to server, then report base info

    PublicData_t query_count_down_response;
    PublicData_t query_relay_state_response;
    PublicData_t query_device_no_response;
    PublicData_t ask_response;  // 纭畾缂?
    PublicData_t nask_response; // 鎷栨嫿?
    PublicData_t unknown_response;
    uint32_t last_ms;
    const uint16_t LOOP_PERIOD_MS = 1000;
    uint8_t stat;
  } public_data_fsm;
  struct
  {
    uint8_t stat;
    const uint16_t MAIN_SCAN_PERIOD_MS = 100;
    uint32_t last_ms; 
  } adc_fsm;
} ctrl_fsm;
/* function declaration ------------------------------------------------------------------------------------------------- */
void Key_cb(Key::KeyEvent_et key_event);
void MQTTRecv_cb(char *topic, uint8_t *payload, uint16_t length);
void WebServer_cb();
void setupCaptivePortal();
String toStringIp(IPAddress ip);
void handleCommand(uint8_t cmd_type, uint8_t *data, uint16_t len);

/* function implementation ------------------------------------------------------------------------------------------------- */
void setup()
{
  Serial.begin(115200);
  tpf("Power on..............");

  // led.Init(LED_SIGNAL, OUTPUT, DOut::ON_POLARITY_LOW);
  relay.Init(RELAY_GPIO, DOut::ON_POLARITY_HIGH);
  key.Init(KEY_GPIO, INPUT_PULLUP, Key_cb, Key::KEY_LOW);

  softserial.begin(9600); // TODO 鎵撳紑杩欎釜锛屽氨浼氬鑷寸郴缁熸棤娉曡繍琛?
  tts.Init(&softserial);
  disp.Init(STB_PIN, CLK_PIN, DIO_PIN);
  param.Init();
  net_client.Init(MQTTRecv_cb);

