zhanglang-jqk/store-devece-esp8266/src/main.cpp
  // 初始化 ADC 引脚
  pinMode(A0, INPUT);   // 设置 A0 为输入模式
}

void loop()
{
  if (millis() - ctrl_fsm.last_ms_st > ctrl_fsm.LOOP_PERIOD_MS)
  {
    // tp();

    if (ctrl_fsm.stat == ctrl_fsm.INIT_STAT) // 鏍规嵁宸蹭繚瀛樼殑缁х數鍣ㄧ姸鎬佹帶鍒剁户鐢靛?
    {
      // tp();
      tpf("free stack:%d, free heap:%d", ESP.getFreeContStack(), ESP.getFreeHeap());
      // param.ResetAllParamToDefault();
      param.LoadAllParam();
      tpt(param.ToString(&param.cur_data));

      ctrl_fsm.stat = ctrl_fsm.CONN_WIFI_STAT;
    }
#if 1
    else if (ctrl_fsm.stat == ctrl_fsm.CONN_WIFI_STAT) // connect to Wifi
    {
      // tp();

      NetClient::WiFiConnResult_et wifi_conn_result = (NetClient::WiFiConnResult_et)net_client.ConnWifi((char *)param.cur_data.wifi_ssid, (char *)param.cur_data.wifi_pwd);
      if (wifi_conn_result == NetClient::WIFI_CONNECED)
      {
        tpf("connect to wifi successful");

        // ctrl_fsm.public_data_fsm.conn_svr_baseinfo_event.send_f = true;

        ctrl_fsm.retry_wifi_cnt = 0;
        ctrl_fsm.conn_mqtt_svr_fsm.retry_cnt = 0;
        ctrl_fsm.stat = ctrl_fsm.CONN_MQTT_SVR_STAT;
        ctrl_fsm.conn_mqtt_svr_fsm.last_ms = millis();
      }
      else if (wifi_conn_result == NetClient::WIFI_CONNECT_TIMEOUT)
      {
        // if (++ctrl_fsm.retry_wifi_cnt > ctrl_fsm.RETRY_WIFI_CONN_CNT)
        // {
        // ctrl_fsm.stat = ctrl_fsm.SYS_RESTART_STAT;
        // tpf("try connect wifi is failed so then restart system");
        // }
        tpf("The %d times, try conenct to wifi is failed", ctrl_fsm.retry_wifi_cnt);
      }
    }
    else if (ctrl_fsm.stat == ctrl_fsm.CONN_MQTT_SVR_STAT) // connect to MQTT server
    {
      if (millis() - ctrl_fsm.conn_mqtt_svr_fsm.last_ms >= ctrl_fsm.conn_mqtt_svr_fsm.LOOP_PERIOD_MS)
      {
        tpf("connect mqtt server, server:%s, port:%d, id:%s, username:%s, password:%s", param.cur_data.mqtt_server, param.cur_data.mqtt_port, param.cur_data.device_id, param.cur_data.mqtt_username,
            param.cur_data.mqtt_password);

        bool isok = net_client.ConnServer((char *)param.cur_data.mqtt_server, param.cur_data.mqtt_port, (char *)param.cur_data.device_id, (char *)param.cur_data.mqtt_username,
                                          (char *)param.cur_data.mqtt_password);
        if (isok)
        {
          tpf("connect to mqtt server successful");

          ctrl_fsm.conn_mqtt_svr_fsm.retry_cnt = 0;
          ctrl_fsm.stat = ctrl_fsm.MQTT_SUBSCRIPT_STAT;
        }
        else
        {
          if (++ctrl_fsm.conn_mqtt_svr_fsm.retry_cnt >= ctrl_fsm.conn_mqtt_svr_fsm.MAX_RETRY_CNT)
          {
            ctrl_fsm.stat = ctrl_fsm.CONN_WIFI_STAT;

            tpf("try connect mqtt server is failed so then reconnect wifi");
          }
          tpf("The %d times, try conenct to mqtt server is failed", ctrl_fsm.conn_mqtt_svr_fsm.retry_cnt);
        }

        ctrl_fsm.conn_mqtt_svr_fsm.last_ms = millis();
      }
    }
    else if (ctrl_fsm.stat == ctrl_fsm.MQTT_SUBSCRIPT_STAT)
    {
      tp();
      // char *device_global_pub_topic = (char *)g_tmpbuf, *device_sub_topic = (char *)g_tmpbuf, *device_pub_topic = (char *)g_tmpbuf;

      // bool isok1 = net_client.Subscribe(param.cur_data.device_global_pub_topic);
      // tpf("subscribe topic is:%s", (char *)device_global_pub_topic);
      // bool isok2 = net_client.Subscribe(device_pub_topic);
      // tpf("subscribe topic is:%s", (char *)device_pub_topic);
      bool isok1 = net_client.Subscribe((char *)param.cur_data.device_sub_topic);
      bool isok2 = net_client.Subscribe((char *)param.cur_data.device_global_sub_topic);
      tpf("subscribe topic is:%s", (char *)param.cur_data.device_sub_topic);

      /* publish relay state to device_pub_topic  -------------------- */
      // memset(g_tmpbuf, 0, sizeof(g_tmpbuf));
      // if (relay.GetPinState() == DOut::ON_STATUS)
      //   sprintf((char *)g_tmpbuf, "{\"device_id\":\"%s\",\"relay\":\"on\"}", param.cur_data.device_id);
      // else
      //   sprintf((char *)g_tmpbuf, "{\"device_id\":\"%s\",\"relay\":\"off\"}", param.cur_data.device_id);
      // isok = net_client.Publish((char *)param.cur_data.device_pub_topic, (char *)g_tmpbuf);
      ctrl_fsm.public_data_fsm.conn_svr_baseinfo_event.send_f = true;

      if (isok1 == false || isok2 == false)
      // if (isok1 == false)
      {
        tpf("subscribe is failed");
        if (++ctrl_fsm.retry_mqtt_subpub_cnt > ctrl_fsm.RETRY_MQTT_SUBPUB_CNT)
        {
          net_client.Disconnect();
          ctrl_fsm.stat = ctrl_fsm.RETRY_MQTT_CONN_CNT;
          tpf("retry subscribe is failed,then try reconnect mqtt");
        }
      }
      else
      {
        // param.cur_data.count_down_minute = 10;
        // ctrl_fsm.count_down_fsm.count_down_start_f = true;

        tpf("subscribe all topics is successful");
        ctrl_fsm.retry_mqtt_subpub_cnt = 0;
        ctrl_fsm.stat = ctrl_fsm.APP_LOOP_STAT;

        relay.Set(param.cur_data.relay);
      }
    }
    else if (ctrl_fsm.stat == ctrl_fsm.SYS_RESTART_STAT)
    {
      // tp();
      tpf("reset system for retry to run system");
      ESP.restart();
    }
    else if (ctrl_fsm.stat == ctrl_fsm.WIFI_INFO_CONFIG_STAT)
    {
      if (ctrl_fsm.wifi_cfg_fsm.stat == 0)
      {
        tpf("wait for receive wifi info");
        ctrl_fsm.wifi_cfg_fsm.stat = 1;
      }
      else if (ctrl_fsm.wifi_cfg_fsm.stat == 1) // valid wifi info
      {
        logf(".");
        if (ctrl_fsm.web_server_fsm.config_finish_f)
        {
          ln();
          tpf("config wifi infomation is finished");
          ctrl_fsm.wifi_cfg_fsm.stat = 0;
          ctrl_fsm.stat = ctrl_fsm.CONN_WIFI_STAT;
          ctrl_fsm.web_server_fsm.config_finish_f = false;
        }
      }
    }
    else if (ctrl_fsm.stat == ctrl_fsm.APP_LOOP_STAT)
    {
      // tp();
      if (net_client.GetWifiConn() == false)
      {
        tpf("wifi is disconnected, then reconnect to wifi");
        ctrl_fsm.stat = ctrl_fsm.CONN_WIFI_STAT;
      }
      else if (net_client.GetMqttConn() == false)
      {
        tpf("mqtt is disconnected, then reconnect to mqtt server");
        ctrl_fsm.stat = ctrl_fsm.CONN_MQTT_SVR_STAT;
      }

