zhanglang-jqk/store-devece-esp8266/src/main.cpp
      net_client.Loop();
    }
#endif
    ctrl_fsm.last_ms_st = millis();
  }

#if 1
  if (millis() - ctrl_fsm.PLAY_VOICE_CMD_fsm.period_last_ms_st > ctrl_fsm.PLAY_VOICE_CMD_fsm.LOOP_PERIOD_MS) // paly voice logic
  {
    if (ctrl_fsm.PLAY_VOICE_CMD_fsm.play_cmd_f)
    {
      if (ctrl_fsm.PLAY_VOICE_CMD_fsm.stat == 0) // Play voice cmd
      {
        tpf("try to play voice cmd to TTS modules, the voice is %s, try times is %d", ctrl_fsm.PLAY_VOICE_CMD_fsm.playbuf, ctrl_fsm.PLAY_VOICE_CMD_fsm.retry_cnt);

        bool isok = tts.SendPlayVoice_cmd((uint8_t *)ctrl_fsm.PLAY_VOICE_CMD_fsm.playbuf, ctrl_fsm.PLAY_VOICE_CMD_fsm.playbuf_len);

        if (isok)
          ctrl_fsm.PLAY_VOICE_CMD_fsm.stat = 1;
        else
          ctrl_fsm.PLAY_VOICE_CMD_fsm.stat = 2;
      }
      else if (ctrl_fsm.PLAY_VOICE_CMD_fsm.stat == 1) // play voice cmd is successful
      {
        tpf("play voice is successful");

        // 鍙戦€佸彇鍙戝竷鎴愬姛浜嬩欢
        ctrl_fsm.public_data_fsm.PLAY_VOICE_CMD_cmd_ok_event.send_f = true;

        ctrl_fsm.PLAY_VOICE_CMD_fsm.play_cmd_f = false;
        ctrl_fsm.PLAY_VOICE_CMD_fsm.stat = 0;
        ctrl_fsm.PLAY_VOICE_CMD_fsm.retry_cnt = 0;
      }
      else if (ctrl_fsm.PLAY_VOICE_CMD_fsm.stat == 2) // play voice cmd is failed
      {
        tpf("retry paly voice cmd to TTS modules again");

        ctrl_fsm.PLAY_VOICE_CMD_fsm.retry_cnt++;
        if (ctrl_fsm.PLAY_VOICE_CMD_fsm.retry_cnt > ctrl_fsm.PLAY_VOICE_CMD_fsm.RETRY_TTS_CNT)
        {
          // 鍙戦€佸彇鍙戝竷澶辫触浜嬩欢
          ctrl_fsm.public_data_fsm.PLAY_VOICE_CMD_cmd_err_event.send_f = true;

          ctrl_fsm.PLAY_VOICE_CMD_fsm.play_cmd_f = false;
          ctrl_fsm.PLAY_VOICE_CMD_fsm.stat = 0;
          ctrl_fsm.PLAY_VOICE_CMD_fsm.retry_cnt = 0;
        }
        else
        {
          tpf("paly voice cmd again");
          ctrl_fsm.PLAY_VOICE_CMD_fsm.stat = 0;
        }
      }
    }

    ctrl_fsm.PLAY_VOICE_CMD_fsm.period_last_ms_st = millis();
  }
#endif
#if 1 // 鏁扮爜绠℃樉绀洪€昏緫
  if (millis() - ctrl_fsm.seg_disp_fsm.main_last_ms >= ctrl_fsm.seg_disp_fsm.MAIN_SCAN_PERIOD_MS)
  {
    if (net_client.GetMqttConn() == false)
    {
      ctrl_fsm.seg_disp_fsm.stat = 1;
    }

    if (ctrl_fsm.seg_disp_fsm.stat == 0) // it display at power on
    {
      disp.DispSeg(0, TM1620::SEG_ROD), disp.DispSeg(1, TM1620::SEG_ROD), disp.DispSeg(2, TM1620::SEG_ROD), disp.DispSeg(3, TM1620::SEG_ROD);
      ctrl_fsm.seg_disp_fsm.stat = 1;
    }
    else if (ctrl_fsm.seg_disp_fsm.stat == 1) // 鏂綉鏃?,鏁扮爜绠￠棯???"-"鎻愮?
    {
      if (ctrl_fsm.seg_disp_fsm.disp_val_f)
        disp.DispSeg(0, TM1620::SEG_NOT_DISPLAY), disp.DispSeg(1, TM1620::SEG_NOT_DISPLAY), disp.DispSeg(2, TM1620::SEG_NOT_DISPLAY), disp.DispSeg(3, TM1620::SEG_NOT_DISPLAY);
      else
        disp.DispSeg(0, TM1620::SEG_ROD), disp.DispSeg(1, TM1620::SEG_ROD), disp.DispSeg(2, TM1620::SEG_ROD), disp.DispSeg(3, TM1620::SEG_ROD);

      ctrl_fsm.seg_disp_fsm.disp_val_f = !ctrl_fsm.seg_disp_fsm.disp_val_f;

      if (net_client.GetMqttConn() == true)
      {
        disp.DispSeg(0, TM1620::SEG_ROD), disp.DispSeg(1, TM1620::SEG_ROD), disp.DispSeg(2, TM1620::SEG_ROD), disp.DispSeg(3, TM1620::SEG_ROD);
        ctrl_fsm.seg_disp_fsm.stat = 2;
      }
    }
    else if (ctrl_fsm.seg_disp_fsm.stat == 2)
    {
      if (ctrl_fsm.count_down_fsm.stat == 0) // wait for count down enable
      {
        if (ctrl_fsm.count_down_fsm.count_down_start_f) ctrl_fsm.count_down_fsm.stat = 1;
      }
      else if (ctrl_fsm.count_down_fsm.stat == 1) // display count down on number segment
      {
        if ((millis() - ctrl_fsm.count_down_fsm.minute_last_ms_st >= 60 * 1000) || (ctrl_fsm.count_down_fsm.minute_last_ms_st == 0)) // 1 minute
        {
          tp();
          if (ctrl_fsm.count_down_fsm.minute_last_ms_st != 0) param.cur_data.count_down_minute--;

          // 计算小时和分钟
          uint8_t hour = param.cur_data.count_down_minute / 60;
          uint8_t hour_10 = hour / 10 % 10, hour_1 = hour % 10;
          uint8_t minute = param.cur_data.count_down_minute % 60;
          uint8_t minute_10 = minute / 10 % 10, minute_1 = minute % 10;

          tpf("count down minute is %d", param.cur_data.count_down_minute);
          tpf("hour_10:%d, hour_1:%d, minute_10:%d, minute_1:%d", hour_10, hour_1, minute_10, minute_1);

          // 清除所有显示位
          for (int i = 0; i < 4; i++)
            disp.DispSeg(i, TM1620::SEG_NOT_DISPLAY);

          delay(500);

          // 始终显示4位数,前导零也显示
          disp.DispSeg(0, hour_10);   // 小时十位
          disp.DispSeg(1, hour_1);    // 小时个位
          disp.DispSeg(2, minute_10); // 分钟十位
          disp.DispSeg(3, minute_1);  // 分钟个位

          ctrl_fsm.count_down_fsm.minute_last_ms_st = millis();
        }

        if ((millis() - ctrl_fsm.count_down_fsm.sec_last_ms_st >= 1000) || (ctrl_fsm.count_down_fsm.sec_last_ms_st == 0)) // 1s
        {
          // 始终显示数字
          uint8_t hour = param.cur_data.count_down_minute / 60;
          uint8_t hour_1 = hour % 10;
          disp.DispSegCode(1, disp.GetCodeNum(hour_1) | (ctrl_fsm.count_down_fsm.disp_colon_f ? 0x80 : 0x00)); // 数字加冒号

          ctrl_fsm.count_down_fsm.disp_colon_f = !ctrl_fsm.count_down_fsm.disp_colon_f;
          ctrl_fsm.count_down_fsm.sec_last_ms_st = millis();
        }

        if (param.cur_data.count_down_minute == 0)
        {
          ctrl_fsm.count_down_fsm.count_down_start_f = false;
        }
        if (ctrl_fsm.count_down_fsm.count_down_start_f == false)
        {
          ctrl_fsm.count_down_fsm.stat = 2;
        }
      }
      // then count down finished or received "count down stop" cmd
      // reset default content to number segment
      if (ctrl_fsm.count_down_fsm.stat == 2)
      {
        // tp();
        disp.DispSeg(0, TM1620::SEG_ROD), disp.DispSeg(1, TM1620::SEG_ROD), disp.DispSeg(2, TM1620::SEG_ROD), disp.DispSeg(3, TM1620::SEG_ROD);
        ctrl_fsm.count_down_fsm.stat = 0;
        ctrl_fsm.count_down_fsm.minute_last_ms_st = 0;
        ctrl_fsm.count_down_fsm.sec_last_ms_st = 0;

        // 鍙戦€佸彇鏁扮爜鏃堕棿浜嬩欢
        ctrl_fsm.public_data_fsm.count_down_finish_event.send_f = true;
      }
    }

    ctrl_fsm.seg_disp_fsm.main_last_ms = millis();
  }
#endif

  { // param logic
    if (ctrl_fsm.param_fsm.stat == 0)
    {
      ctrl_fsm.param_fsm.last_ms_st = millis();
      ctrl_fsm.param_fsm.stat = 1;
    }
    else if (ctrl_fsm.param_fsm.stat == 1)
    {
      if (millis() - ctrl_fsm.param_fsm.last_ms_st >= ctrl_fsm.param_fsm.LOOP_PERIOD_MS) // 1S
      {
        param.UpdateParam_pool();
      }
    }
  }
#if 1
  { // web server logic
    if (ctrl_fsm.web_server_fsm.stat == 0)
    {
      ctrl_fsm.web_server_fsm.last_ms_st = millis();
      ctrl_fsm.web_server_fsm.stat = 1;
    }
    else if (ctrl_fsm.web_server_fsm.stat == 1)
    {
      if (millis() - ctrl_fsm.web_server_fsm.last_ms_st >= ctrl_fsm.web_server_fsm.LOOP_PERIOD_MS) // 10ms
      {
        if (ctrl_fsm.web_server_fsm.ap_en) {
          dnsServer.processNextRequest();
          net_client.WebServer_pool();
        }
        ctrl_fsm.web_server_fsm.last_ms_st = millis();
      }
    }
  }
#endif

#if 1
  { // key logic
  { // key pool
if (ctrl_fsm.key_fsm.stat == 0)
    {
      // tp();
      ctrl_fsm.key_fsm.last_ms_st = millis();
      ctrl_fsm.key_fsm.stat = 1;
    }
    else if (ctrl_fsm.key_fsm.stat == 1)
    {
      if (millis() - ctrl_fsm.key_fsm.last_ms_st >= ctrl_fsm.key_fsm.LOOP_PERIOD_MS)
      {
        // tp();
        key.pool();
        ctrl_fsm.key_fsm.last_ms_st = millis();
      }
    }
  }
  { // key event
    if (ctrl_fsm.key_fsm.event_f == 1)  // direct toggle door
    {
        bool state = relay.Toggle();
        tpf("relay state is %d", state);
        param.cur_data.relay = (uint8_t)state;
        
