zhanglang-jqk/store-devece-esp8266/src/main.cpp
        // 播报继电器状态
        if(state) {
            uint8_t buf[] = {0xbf,0xaa,0xc3,0xc5}; // 播报"开门"
            tts.SendPlayVoice_cmd(buf, sizeof(buf));
        } else {
            uint8_t buf[] = {0xb9,0xd8,0xc3,0xc5}; // 播报"关门" 
            tts.SendPlayVoice_cmd(buf, sizeof(buf));
        }
        
        ctrl_fsm.key_fsm.event_f = 0;
    }
    else if (ctrl_fsm.key_fsm.event_f == 2)  // auto close door
    {
      if(ctrl_fsm.key_fsm.event_stat == 0)
      {
        param.cur_data.relay = (uint8_t)relay.On();
        uint8_t buf[] = {0xbf,0xaa,0xc3,0xc5}; // 播报"开门"
        tts.SendPlayVoice_cmd(buf, sizeof(buf));
        ctrl_fsm.key_fsm.event_stat = 1;
      }
      else if(ctrl_fsm.key_fsm.event_stat == 1)
      {
        if(millis() - ctrl_fsm.key_fsm.event_last_ms_st >= param.cur_data.auto_close_door_time_s * 1000)
        {
          param.cur_data.relay = (uint8_t)relay.Off();
          uint8_t buf[] = {0xb9,0xd8,0xc3,0xc5}; // 播报"关门"
          tts.SendPlayVoice_cmd(buf, sizeof(buf));
          ctrl_fsm.key_fsm.event_stat = 0;
          ctrl_fsm.key_fsm.event_f = 0;
        }
      }
      else if(ctrl_fsm.key_fsm.event_stat == 2) // wifi infomation config
      {
        uint8_t buf[] = {0xbf,0xaa,0xca,0xbc,0xc5,0xe4,0xcd,0xf8};  // 播��"开始配网"
        tts.SendPlayVoice_cmd(buf, sizeof(buf));
        net_client.WebServer_start((char *)param.cur_data.ap_ssid, (char *)param.cur_data.ap_pwd, WebServer_cb);
        setupCaptivePortal();
        ctrl_fsm.web_server_fsm.ap_en = true;
        ctrl_fsm.stat = ctrl_fsm.WIFI_INFO_CONFIG_STAT;
        ctrl_fsm.key_fsm.event_f = 0;
      }
    }
    else if (ctrl_fsm.key_fsm.event_f == 3) 
    {
        ctrl_fsm.key_fsm.event_f = 0;
    }
    else if (ctrl_fsm.key_fsm.event_f == 6)
    {
      tpf("key triple press");
      // 这里添加三击的处理逻辑
      uint8_t buf[] = {0xc8,0xfd,0xbb,0xf7,0xb0,0xb4,0xbc,0xfc}; // 播报"三击按键"
      tts.SendPlayVoice_cmd(buf, sizeof(buf));
      // 可以在这里添加你想要的三击功能
    }
  }  
  }
#endif
#if 1
  if(millis() - ctrl_fsm.public_data_fsm.last_ms > ctrl_fsm.public_data_fsm.LOOP_PERIOD_MS)
  {
    if(net_client.GetMqttConn())
    {
      if(ctrl_fsm.public_data_fsm.conn_svr_baseinfo_event.send_f)
      {
        memset(g_tmpbuf,0,sizeof(g_tmpbuf));
        int result = snprintf((char *)g_tmpbuf, sizeof(g_tmpbuf),
          R"({"system_info_event":{"%s":"%d","%s":"%d","%s":%d,"%s":"%s","%s":"%s","%s":"%s","%s":%d,"%s":"%s","%s":"%s","%s":%d,"%s":%d,"%s":"%s","%s":%d,"%s":%d,"%s":"%s","%s":"%s"}})",
          "soft_ver", param.cur_data.soft_ver,
          "hard_ver", param.cur_data.hard_ver,
          "relay", param.cur_data.relay,
          "wifi_ssid", param.cur_data.wifi_ssid,
          "wifi_pwd", param.cur_data.wifi_pwd,
          "mqtt_server", param.cur_data.mqtt_server,
          "mqtt_port", param.cur_data.mqtt_port,
          "mqtt_username", param.cur_data.mqtt_username,
          "mqtt_password", param.cur_data.mqtt_password,
          "count_down_minute", param.cur_data.count_down_minute,
          "count_down_start_f", ctrl_fsm.count_down_fsm.count_down_start_f,
          "device_id", param.cur_data.device_id,
          "open_door_mode", param.cur_data.open_door_mode,
          "auto_close_door_time_s", param.cur_data.auto_close_door_time_s,
          "device_sub_topic",param.cur_data.device_sub_topic,
          "device_pub_topic",param.cur_data.device_pub_topic
        );
        
        if (result < 0 || result >= sizeof(g_tmpbuf)) {
          // Handle buffer overflow
          tpf("Error: Buffer overflow when generating system info");
          g_tmpbuf[sizeof(g_tmpbuf) - 1] = '\0';  // Ensure null-termination
        }

        tpf("publish system info to topic: %s", param.cur_data.device_pub_topic);
        tpf("system info: %s", (char *)g_tmpbuf);
        net_client.Publish((char *)param.cur_data.device_pub_topic, (char *)g_tmpbuf);
        net_client.Publish((char *)param.cur_data.device_global_pub_topic, (char *)g_tmpbuf);

        ctrl_fsm.public_data_fsm.conn_svr_baseinfo_event.send_f = false;
      }

      if (ctrl_fsm.public_data_fsm.count_down_finish_event.send_f)
      {
        memset(g_tmpbuf, 0, sizeof(g_tmpbuf));
        cmd_pkt.BuildJsonPkt((char *)g_tmpbuf, "countdown_finish_event", (uint8_t)1);
        net_client.Publish((char *)param.cur_data.device_pub_topic, (char *)g_tmpbuf);
        net_client.Publish((char *)param.cur_data.device_global_pub_topic, (char *)g_tmpbuf);
        tpf("publish count down finish event: %s", (char *)g_tmpbuf);
        ctrl_fsm.public_data_fsm.count_down_finish_event.send_f = false;
      }

      if (ctrl_fsm.public_data_fsm.PLAY_VOICE_CMD_cmd_ok_event.send_f)
      {
        memset(g_tmpbuf, 0, sizeof(g_tmpbuf));
        cmd_pkt.BuildJsonPkt((char *)g_tmpbuf, "play_voice_result_event", (uint8_t)1);
        net_client.Publish((char *)param.cur_data.device_pub_topic, (char *)g_tmpbuf);
        net_client.Publish((char *)param.cur_data.device_global_pub_topic, (char *)g_tmpbuf);
        tpf("publish play voice command OK event: %s", (char *)g_tmpbuf);
        ctrl_fsm.public_data_fsm.PLAY_VOICE_CMD_cmd_ok_event.send_f = false;
      }

      if (ctrl_fsm.public_data_fsm.PLAY_VOICE_CMD_cmd_err_event.send_f)
      {
        memset(g_tmpbuf, 0, sizeof(g_tmpbuf));
        cmd_pkt.BuildJsonPkt((char *)g_tmpbuf, "play_voice_result_event", (uint8_t)0);
        net_client.Publish((char *)param.cur_data.device_pub_topic, (char *)g_tmpbuf);
        net_client.Publish((char *)param.cur_data.device_global_pub_topic, (char *)g_tmpbuf);
        tpf("publish play voice command error event: %s", (char *)g_tmpbuf);
        ctrl_fsm.public_data_fsm.PLAY_VOICE_CMD_cmd_err_event.send_f = false;
      }

      if (ctrl_fsm.public_data_fsm.ask_response.send_f)
      {
        memset(g_tmpbuf, 0, sizeof(g_tmpbuf));
        cmd_pkt.BuildJsonPkt((char *)g_tmpbuf, "ask", (uint8_t)1);  // 确认应答
        net_client.Publish((char *)param.cur_data.device_pub_topic, (char *)g_tmpbuf);
        net_client.Publish((char *)param.cur_data.device_global_pub_topic, (char *)g_tmpbuf);
        tpf("publish ask response: %s", (char *)g_tmpbuf);
        ctrl_fsm.public_data_fsm.ask_response.send_f = false;
      }

      if (ctrl_fsm.public_data_fsm.nask_response.send_f)
      {
        memset(g_tmpbuf, 0, sizeof(g_tmpbuf));
        cmd_pkt.BuildJsonPkt((char *)g_tmpbuf, "ask", (uint8_t)0);  // 否认应答
        net_client.Publish((char *)param.cur_data.device_pub_topic, (char *)g_tmpbuf);
        net_client.Publish((char *)param.cur_data.device_global_pub_topic, (char *)g_tmpbuf);
        tpf("publish nask response: %s", (char *)g_tmpbuf);
        ctrl_fsm.public_data_fsm.nask_response.send_f = false;
      }

      if (ctrl_fsm.public_data_fsm.unknown_response.send_f)
      {
        memset(g_tmpbuf, 0, sizeof(g_tmpbuf));
        cmd_pkt.BuildJsonPkt((char *)g_tmpbuf, "unknown_cmd", (uint8_t)0);  // 未知命令应答
        net_client.Publish((char *)param.cur_data.device_pub_topic, (char *)g_tmpbuf);
        net_client.Publish((char *)param.cur_data.device_global_pub_topic, (char *)g_tmpbuf);
        tpf("publish unknown command response: %s", (char *)g_tmpbuf);
        ctrl_fsm.public_data_fsm.unknown_response.send_f = false;
      }

      
      {
      // 检查继电器状态是否发生变化
        static uint8_t last_relay_state = 255; // 初始化为一个不可能的值
        if (param.cur_data.relay != last_relay_state)
        {
          // 继电器状态发生变化，准备上报事件
          memset(g_tmpbuf, 0, sizeof(g_tmpbuf));
          cmd_pkt.BuildJsonPkt((char *)g_tmpbuf, "relay_state_change_event", (uint8_t)param.cur_data.relay);
          net_client.Publish((char *)param.cur_data.device_pub_topic, (char *)g_tmpbuf);
          net_client.Publish((char *)param.cur_data.device_global_pub_topic, (char *)g_tmpbuf);
          tpf("publish relay state change event: %s", (char *)g_tmpbuf);
          // 更新上一次的继电器状态
          last_relay_state = param.cur_data.relay;
        }
      }
    }
  }
  
#endif

  if (millis() - ctrl_fsm.adc_fsm.last_ms >= ctrl_fsm.adc_fsm.MAIN_SCAN_PERIOD_MS)
  {
    if(ctrl_fsm.adc_fsm.stat == 0)
    {
      int adc_value = analogRead(A0);
      // tpf("adc value is %d", adc_value);
      if (adc_value < 800) {
        tpf("adc value is less than 800, open door");
        if (param.cur_data.open_door_mode == 0) {
          ctrl_fsm.key_fsm.event_f = 1; // direct toggle door
          ctrl_fsm.adc_fsm.stat = 1;  
        }
        else if (param.cur_data.open_door_mode == 1) {
          ctrl_fsm.key_fsm.event_stat = 0; // auto close door
          ctrl_fsm.key_fsm.event_last_ms_st = millis();
          ctrl_fsm.key_fsm.event_f = 2; // auto close door
          ctrl_fsm.adc_fsm.stat = 1;
        }
      }
    }
    else if(ctrl_fsm.adc_fsm.stat == 1) // 避免重复触发
    {
      int adc_value = analogRead(A0);
      if (adc_value >= 800) {
        ctrl_fsm.adc_fsm.stat = 0;
      }
    }

    ctrl_fsm.adc_fsm.last_ms = millis();
  }

