zhanglang-jqk/store-devece-esp8266/src/main.cpp
}

void Key_cb(Key::KeyEvent_et key_event)
{
  if (key_event == Key::KeyEvent_et::CLICK)
  {
    tpf("key short press");

    if (param.cur_data.open_door_mode == 0) {
      ctrl_fsm.key_fsm.event_f = 1; // direct toggle door
    }
    else if (param.cur_data.open_door_mode == 1) {
      ctrl_fsm.key_fsm.event_stat = 0; // auto close door
      ctrl_fsm.key_fsm.event_last_ms_st = millis();
      ctrl_fsm.key_fsm.event_f = 2; // auto close door
    }
  }
  else if (key_event == Key::KeyEvent_et::LONG_CLICK)
  {
    tpf("key long press");
    if (ctrl_fsm.stat == ctrl_fsm.WIFI_INFO_CONFIG_STAT) {
      // 如果当前在配网状态,则退出配网
      uint8_t buf[] = {0xcd,0xa3,0xd6,0xb9,0xc5,0xe4,0xcd,0xf8}; // 播报"停止配网"
      tts.SendPlayVoice_cmd(buf, sizeof(buf));
      
      net_client.WebServer_stop();
      ctrl_fsm.web_server_fsm.ap_en = false;
      ctrl_fsm.wifi_cfg_fsm.stat = 0;
      ctrl_fsm.stat = ctrl_fsm.CONN_WIFI_STAT;
      ctrl_fsm.web_server_fsm.config_finish_f = false;
    } else {
      // 不在配网状态,则进入配网
      ctrl_fsm.key_fsm.event_f = 2; // wifi info config
      ctrl_fsm.key_fsm.event_stat = 2;
    }
  }
  else if (key_event == Key::KeyEvent_et::DOUBLE_CLICK)
  {
    tpf("key double press, restarting system...");
    uint8_t buf[] = {0xc9,0xe8,0xb1,0xb8,0xd6,0xd8,0xc6,0xf4}; // 播报"设备重启"
    tts.SendPlayVoice_cmd(buf, sizeof(buf));
    static Ticker restartTicker;
    restartTicker.once(2, []() {
      ESP.restart();
    });
  }
  else if (key_event == Key::KeyEvent_et::TRIPLE_CLICK)
  {
    tpf("key triple press, resetting to factory defaults...");
    uint8_t buf[] = {0xbb,0xd6,0xb8,0xb4,0xb3,0xf6,0xb3,0xa7,0xc9,0xe8,0xd6,0xc3}; // 播报"恢复出厂设置"
    tts.SendPlayVoice_cmd(buf, sizeof(buf));
    
    // 恢复出厂设置
    param.ResetAllParamToDefault();
    
    // 2秒后重��设备
    static Ticker restartTicker;
    restartTicker.once(2, []() {
      ESP.restart();
    });
  }
}

void WebServer_cb() 
{
  tp();
  ctrl_fsm.wifi_cfg_fsm.ssid = net_client.GetArg("ssid");
  ctrl_fsm.wifi_cfg_fsm.pwd = net_client.GetArg("password");
  Serial.println("Received SSID: " + ctrl_fsm.wifi_cfg_fsm.ssid);
  Serial.println("Received Password: " + ctrl_fsm.wifi_cfg_fsm.pwd);
  strcpy((char *)param.cur_data.wifi_ssid, ctrl_fsm.wifi_cfg_fsm.ssid.c_str());
  strcpy((char *)param.cur_data.wifi_pwd, ctrl_fsm.wifi_cfg_fsm.pwd.c_str());

  if (ctrl_fsm.wifi_cfg_fsm.ssid.length() != 0 && ctrl_fsm.wifi_cfg_fsm.pwd.length() != 0)
  {
    ctrl_fsm.web_server_fsm.config_finish_f = true;
  }

  tpf("config wifi infomation is finished");
  String response = "{\"status\":\"success\",\"message\":\"WiFi 配置完成\"}";
  NetClient::server.send(200, "application/json", response);
  delay(800), ESP.wdtFeed(), delay(800), ESP.wdtFeed();

  uint8_t buf[] = {0xc5,0xe4,0xcd,0xf8,0xcd,0xea,0xb3,0xc9};  // 播报"配网完成"的GBK编码
  tts.SendPlayVoice_cmd(buf, sizeof(buf));

  net_client.WebServer_stop();
  ctrl_fsm.web_server_fsm.ap_en = false;
  ctrl_fsm.wifi_cfg_fsm.stat = 0;
  ctrl_fsm.stat = ctrl_fsm.CONN_WIFI_STAT;
  ctrl_fsm.web_server_fsm.config_finish_f = false;
}

void setupCaptivePortal() {
  WiFi.mode(WIFI_AP);
  WiFi.softAPConfig(apIP, apIP, IPAddress(255, 255, 255, 0));
  WiFi.softAP((char *)param.cur_data.ap_ssid, (char *)param.cur_data.ap_pwd);

  // Configure DNS server to redirect all domains to the AP's IP
  dnsServer.start(DNS_PORT, "*", apIP);

  NetClient::server.on("/", HTTP_GET, []() {
    NetClient::server.sendHeader("Location", String("http://") + toStringIp(NetClient::server.client().localIP()), true);
    NetClient::server.send(302, "text/plain", "");
  });

  NetClient::server.onNotFound([]() {
    NetClient::server.sendHeader("Location", String("http://") + toStringIp(NetClient::server.client().localIP()), true);
    NetClient::server.send(302, "text/plain", "");
  });
}

String toStringIp(IPAddress ip) {
  String res = "";
  for (int i = 0; i < 3; i++) {
    res += String((ip >> (8 * i)) & 0xFF) + ".";
  }
  res += String(((ip >> 8 * 3)) & 0xFF);
  return res;
}

/**
 * @brief Callback function for receiving MQTT messages.
 *
 * This function is called when an MQTT message is received.
 * It parses the received message and performs corresponding actions based on the command.
 *
 * @param topic The topic of the received message.
 * @param payload The payload of the received message.
 * @param length The length of the payload.
//  */
void MQTTRecv_cb(char *topic, uint8_t *payload, uint16_t length)
{
#if 1
  char _payload[length + 1];
  memset(_payload, 0, sizeof(_payload)), memcpy(_payload, payload, length);
  tpf("MQTTRecv_cb, topic:%s, payload:%s", topic, _payload);

  // static char device_sub_topic[64];
  // memset(device_sub_topic, 0, sizeof(device_sub_topic));
  // sprintf(device_sub_topic, "%s/%s", param.cur_data.device_id, param.cur_data.device_sub_topic);

  if (strcmp(topic, (char *)param.cur_data.device_sub_topic) == 0)
  {
    char cmd_no[32];
    memset(cmd_no, 0, sizeof(cmd_no));
    cmd_pkt.GetCmdNo(cmd_no, payload, length);
    tpf("cmd_no:%s", cmd_no);

    if (strcmp(cmd_no, CmdPkt::SET_MQTT_SERVER_CMD) == 0)
    {
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, (char *)param.cur_data.mqtt_server);
      ctrl_fsm.public_data_fsm.ask_response.send_f = true;      
    }
    else if (strcmp(cmd_no, CmdPkt::SET_WIFI_SSID_CMD) == 0)
    {
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, (char *)param.cur_data.wifi_ssid);
      ctrl_fsm.public_data_fsm.ask_response.send_f = true;      
    }
    else if (strcmp(cmd_no, CmdPkt::SET_WIFI_PWD_CMD) == 0)
    {
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, (char *)param.cur_data.wifi_pwd);
      ctrl_fsm.public_data_fsm.ask_response.send_f = true;      
    }
    else if (strcmp(cmd_no, CmdPkt::SET_MQTT_USERNAME_CMD) == 0)
    {
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, (char *)param.cur_data.mqtt_username);
      ctrl_fsm.public_data_fsm.ask_response.send_f = true;      
    }
    else if (strcmp(cmd_no, CmdPkt::SET_MQTT_PASSWORD_CMD) == 0)
    {
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, (char *)param.cur_data.mqtt_password);
      ctrl_fsm.public_data_fsm.ask_response.send_f = true;      
    }
    else if (strcmp(cmd_no, CmdPkt::OPEN_RELAY_CMD) == 0)
    {
      // param.cur_data.relay = (uint8_t)relay.On();
      // tpf("received cmd, open relay");

      if (param.cur_data.open_door_mode == 0) {
      ctrl_fsm.key_fsm.event_f = 1; // direct toggle door
      }
      else if (param.cur_data.open_door_mode == 1) {
        ctrl_fsm.key_fsm.event_stat = 0; // auto close door
        ctrl_fsm.key_fsm.event_last_ms_st = millis();
        ctrl_fsm.key_fsm.event_f = 2; // auto close door
      }

