zhanglang-jqk/store-devece-esp8266/src/main.cpp
      ctrl_fsm.public_data_fsm.ask_response.send_f = true;      
    }
    else if (strcmp(cmd_no, CmdPkt::CLOSE_RELAY_CMD) == 0)
    {
      if (param.cur_data.open_door_mode == 0) {      // direct mode
        param.cur_data.relay = (uint8_t)relay.Off();
        tpf("received cmd, close relay");
        ctrl_fsm.public_data_fsm.ask_response.send_f = true;      
      }else if(param.cur_data.open_door_mode == 1){
        tpf("current mode is auto close door mode, don't direct close door");
        ctrl_fsm.public_data_fsm.nask_response.send_f = false;
      }
    }
    else if (strcmp(cmd_no, CmdPkt::GET_SYSTEM_INFO_CMD) == 0)
    {
      ctrl_fsm.public_data_fsm.conn_svr_baseinfo_event.send_f = true;      
      // ctrl_fsm.public_data_fsm.ask_response.send_f = true;
    }
    else if (strcmp(cmd_no, CmdPkt::SET_MQTT_PORT_CMD) == 0)
    {
      uint16_t port;
      cmd_pkt.ExtractIntOfBuf((char *)payload, length, &port);
      param.cur_data.mqtt_port = port;
      ctrl_fsm.public_data_fsm.ask_response.send_f = true;
    }
    else if (strcmp(cmd_no, CmdPkt::PLAY_VOICE_CMD) == 0)
    {
      ctrl_fsm.PLAY_VOICE_CMD_fsm.play_cmd_f = true;
      ctrl_fsm.PLAY_VOICE_CMD_fsm.playbuf_len = cmd_pkt.ExtractGbkHexStrOfBuf((char *)payload, length, ctrl_fsm.PLAY_VOICE_CMD_fsm.playbuf);
      tpbuf(ctrl_fsm.PLAY_VOICE_CMD_fsm.playbuf, ctrl_fsm.PLAY_VOICE_CMD_fsm.playbuf_len);
    }
    else if (strcmp(cmd_no, CmdPkt::SET_COUNT_DOWN_CMD) == 0)
    {
      uint16_t count_down = 0;
      cmd_pkt.ExtractIntOfBuf((char *)payload, length, &count_down);
      tpf("count down: %d", count_down);
      param.cur_data.count_down_minute = count_down;
      
      // 重置倒计时相关时间戳,触发立即更新显示
      ctrl_fsm.count_down_fsm.minute_last_ms_st = 0;
      ctrl_fsm.count_down_fsm.sec_last_ms_st = 0;
      
      ctrl_fsm.public_data_fsm.ask_response.send_f = true;
    }
    else if (strcmp(cmd_no, CmdPkt::OPEN_COUNT_DOWN_CMD) == 0)
    {
      tpf("open count down");
      ctrl_fsm.count_down_fsm.count_down_start_f = true;
      ctrl_fsm.public_data_fsm.ask_response.send_f = true; 
    }
    else if (strcmp(cmd_no, CmdPkt::CLOSE_COUNT_DOWN_CMD) == 0)
    {
      tpf("close count down");
      ctrl_fsm.count_down_fsm.count_down_start_f = false;
      ctrl_fsm.public_data_fsm.ask_response.send_f = true;
    }
    else if (strcmp(cmd_no, CmdPkt::SET_OPEN_DOOR_MODE_CMD) == 0)
    {
      uint8_t door_mode; cmd_pkt.ExtractIntOfBuf((char *)payload, length, &door_mode);
      param.cur_data.open_door_mode = door_mode;
      ctrl_fsm.public_data_fsm.ask_response.send_f = true;
    }
    else if (strcmp(cmd_no, CmdPkt::SET_SOFT_VER_CMD) == 0)
    {
      char new_soft_ver[32];
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, new_soft_ver);
      // Assuming there's a software version field in param.cur_data
      strncpy((char *)param.cur_data.soft_ver, new_soft_ver, sizeof(param.cur_data.soft_ver));
      ctrl_fsm.public_data_fsm.ask_response.send_f = true;
    }
    else if (strcmp(cmd_no, CmdPkt::SET_HARD_VER_CMD) == 0)
    {
      char new_hard_ver[32];
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, new_hard_ver);
      // Assuming there's a hardware version field in param.cur_data
      strncpy((char *)param.cur_data.hard_ver, new_hard_ver, sizeof(param.cur_data.hard_ver));
      ctrl_fsm.public_data_fsm.ask_response.send_f = true;
    }
    else if (strcmp(cmd_no, CmdPkt::SET_DEVECE_ID_CMD) == 0)
    {
      tp();
      char new_device_id[32];
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, new_device_id);
      // Assuming there's a device ID field in param.cur_data
      strncpy((char *)param.cur_data.device_id, new_device_id, sizeof(param.cur_data.device_id));
      // Update device_sub_topic and device_pub_topic based on the new device_id
      snprintf((char *)param.cur_data.device_sub_topic, sizeof(param.cur_data.device_sub_topic), "%s/device_sub_topic", param.cur_data.device_id);
      snprintf((char *)param.cur_data.device_pub_topic, sizeof(param.cur_data.device_pub_topic), "%s/device_pub_topic", param.cur_data.device_id);
      tpf("Updated device topics - Sub: %s, Pub: %s", param.cur_data.device_sub_topic, param.cur_data.device_pub_topic);
      ctrl_fsm.public_data_fsm.ask_response.send_f = true;
    }
    else if (strcmp(cmd_no, CmdPkt::FACTORY_PARAMS_CMD) == 0)
    {
      tpf("received factory params cmd");
      // Reset all parameters to factory defaults
      param.ResetAllParamToDefault();
      ctrl_fsm.public_data_fsm.ask_response.send_f = true;
    }
    else if (strcmp(cmd_no,CmdPkt::RESTART_CMD) == 0)
    {
      tpf("Restarting system...");
      ctrl_fsm.public_data_fsm.ask_response.send_f = true;
      // Schedule a system restart using Tick's once function
      static Ticker restartTicker;
      restartTicker.once(2, []() {
        ESP.restart();
      });
      tpf("System restart scheduled in 2 second");
    }
    else if (strcmp(cmd_no, CmdPkt::SET_DEVICE_GLOBAL_PUB_TOPIC_CMD) == 0)
    {
      char new_global_pub_topic[64];
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, new_global_pub_topic);
      strncpy((char *)param.cur_data.device_global_pub_topic, new_global_pub_topic, sizeof(param.cur_data.device_global_pub_topic));
      tpf("Updated global pub topic: %s", param.cur_data.device_global_pub_topic);
      ctrl_fsm.public_data_fsm.ask_response.send_f = true;
    }
    else if (strcmp(cmd_no, CmdPkt::SET_DEVICE_GLOBAL_SUB_TOPIC_CMD) == 0)
    {
      char new_global_sub_topic[64];
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, new_global_sub_topic);
      strncpy((char *)param.cur_data.device_global_sub_topic, new_global_sub_topic, sizeof(param.cur_data.device_global_sub_topic));
      tpf("Updated global sub topic: %s", param.cur_data.device_global_sub_topic);
      ctrl_fsm.public_data_fsm.ask_response.send_f = true;
    }
    else
    {
      tpf("unknown cmd");
      ctrl_fsm.public_data_fsm.unknown_response.send_f = true;
    }
  }
#endif
}
#endif

// main.cpp
